---
kind: method
id: M:Autodesk.Revit.DB.ElementPhaseStatusFilter.GetPhaseStatuses
source: html/0cb36c92-6d1c-6715-9e68-fca6a889628e.htm
---
# Autodesk.Revit.DB.ElementPhaseStatusFilter.GetPhaseStatuses Method

Returns the phase statuses assigned to this filter.

## Syntax (C#)
```csharp
public ICollection<ElementOnPhaseStatus> GetPhaseStatuses()
```

## Returns
The phase statuses.